In [ ]:
#Question 1:
import pandas
df=pandas.read_csv('Lab2 D1A.csv')
df2=pandas.read_csv('Lab2 D1B.csv')
print(df)

         fid                                        name  population  \
0       9001               NEW ENGLAND CHRISTIAN ACADEMY         136
1       9002                     SETON ACADEMY FOR GIRLS          57
2       9003                              ST ANNA SCHOOL         157
3       9004  SOUTHEAST ALTERNATIVE SCHOOL-MIDDLE SCHOOL           5
4       9005                             DEVEREUX SCHOOL         123
...      ...                                         ...         ...
26978  20996                         MOST PRECIOUS BLOOD          33
26979  20997                               STARR ACADEMY          29
26980  20998                   ST JOHN'S LUTHERAN SCHOOL          24
26981  20999                     FAITH CHRISTIAN ACADEMY          13
26982  21000                           SHADY PINE SCHOOL          17

          county   latitude
0        BRISTOL  41.758597
1        BRISTOL  41.718407
2      WORCESTER  42.517271
3       PLYMOUTH  41.818210
4      WORCESTER  42.383875
...          ...        ...
26978    WAUPACA  44.386281
26979    WAUPACA  44.308621
26980   WAUSHARA  44.202182
26981   WAUSHARA  44.074503
26982   WAUSHARA  44.014975

[26983 rows x 5 columns]

In [3]:
print(df2)

                                             name  population     county  \
0                   NEW ENGLAND CHRISTIAN ACADEMY         136    BRISTOL
1                         SETON ACADEMY FOR GIRLS          57    BRISTOL
2                                  ST ANNA SCHOOL         157  WORCESTER
3      SOUTHEAST ALTERNATIVE SCHOOL-MIDDLE SCHOOL           5   PLYMOUTH
4                                 DEVEREUX SCHOOL         123  WORCESTER
...                                           ...         ...        ...
26978                         MOST PRECIOUS BLOOD          33    WAUPACA
26979                               STARR ACADEMY          29    WAUPACA
26980                   ST JOHN'S LUTHERAN SCHOOL          24   WAUSHARA
26981                     FAITH CHRISTIAN ACADEMY          13   WAUSHARA
26982                           SHADY PINE SCHOOL          17   WAUSHARA

       longitude                              level  enrollment  \
0     -71.175801  Combined elementary and secondary         120
1     -71.147302                         Elementary          49
2     -71.751741                         Elementary         143
3     -71.083393                         Elementary           4
4     -71.968419  Combined elementary and secondary         107
...          ...                                ...         ...
26978 -88.739200                         Elementary          28
26979 -88.848294                          Secondary          21
26980 -88.886093                         Elementary          22
26981 -89.294984                         Elementary          11
26982 -89.377692                         Elementary          16

                                 level.1
0      Combined elementary and secondary
1                             Elementary
2                             Elementary
3                             Elementary
4      Combined elementary and secondary
...                                  ...
26978                         Elementary
26979                          Secondary
26980                         Elementary
26981                         Elementary
26982                         Elementary

[26983 rows x 7 columns]

In [14]:
df.info()
df2.info()
df['population'].is_unique

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26983 entries, 0 to 26982
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   fid         26983 non-null  int64
 1   name        26983 non-null  object
 2   population  26983 non-null  int64
 3   county      26983 non-null  object
 4   latitude    26983 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 1.0+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26983 entries, 0 to 26982
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        26983 non-null  object
 1   population  26983 non-null  int64
 2   county      26983 non-null  object
 3   longitude   26983 non-null  float64
 4   level       26983 non-null  object
 5   enrollment  26983 non-null  int64
 6   level.1     26983 non-null  object
dtypes: float64(1), int64(2), object(4)
memory usage: 1.4+ MB

False

In [ ]:
df.describe()

         population     longitude    enrollment
count  26983.000000  26983.000000  26983.000000
mean     162.137160    -90.511958    148.341363
std      229.262453     16.700713    212.502913
min        1.000000   -162.583813      1.000000
25%       25.000000    -97.063117     21.000000
50%       79.000000    -85.604077     70.000000
75%      211.000000    -77.137074    194.000000
max     6446.000000    -67.388740   5840.000000

In [9]:
df2.describe()

         population     longitude    enrollment
count  26983.000000  26983.000000  26983.000000
mean     162.137160    -90.511958    148.341363
std      229.262453     16.700713    212.502913
min        1.000000   -162.583813      1.000000
25%       25.000000    -97.063117     21.000000
50%       79.000000    -85.604077     70.000000
75%      211.000000    -77.137074    194.000000
max     6446.000000    -67.388740   5840.000000

In [33]:
merged_df=pandas.concat([df,df2],axis=1,ignore_index=True)
print(merged_df)

          0                                           1    2          3   \
0       9001               NEW ENGLAND CHRISTIAN ACADEMY  136    BRISTOL
1       9002                     SETON ACADEMY FOR GIRLS   57    BRISTOL
2       9003                              ST ANNA SCHOOL  157  WORCESTER
3       9004  SOUTHEAST ALTERNATIVE SCHOOL-MIDDLE SCHOOL    5   PLYMOUTH
4       9005                             DEVEREUX SCHOOL  123  WORCESTER
...      ...                                         ...  ...        ...
26978  20996                         MOST PRECIOUS BLOOD   33    WAUPACA
26979  20997                               STARR ACADEMY   29    WAUPACA
26980  20998                   ST JOHN'S LUTHERAN SCHOOL   24   WAUSHARA
26981  20999                     FAITH CHRISTIAN ACADEMY   13   WAUSHARA
26982  21000                           SHADY PINE SCHOOL   17   WAUSHARA

              4                                           5    6          7   \
0      41.758597               NEW ENGLAND CHRISTIAN ACADEMY  136    BRISTOL
1      41.718407                     SETON ACADEMY FOR GIRLS   57    BRISTOL
2      42.517271                              ST ANNA SCHOOL  157  WORCESTER
3      41.818210  SOUTHEAST ALTERNATIVE SCHOOL-MIDDLE SCHOOL    5   PLYMOUTH
4      42.383875                             DEVEREUX SCHOOL  123  WORCESTER
...          ...                                         ...  ...        ...
26978  44.386281                         MOST PRECIOUS BLOOD   33    WAUPACA
26979  44.308621                               STARR ACADEMY   29    WAUPACA
26980  44.202182                   ST JOHN'S LUTHERAN SCHOOL   24   WAUSHARA
26981  44.074503                     FAITH CHRISTIAN ACADEMY   13   WAUSHARA
26982  44.014975                           SHADY PINE SCHOOL   17   WAUSHARA

              8                                  9    10  \
0     -71.175801  Combined elementary and secondary  120
1     -71.147302                         Elementary   49
2     -71.751741                         Elementary  143
3     -71.083393                         Elementary    4
4     -71.968419  Combined elementary and secondary  107
...          ...                                ...  ...
26978 -88.739200                         Elementary   28
26979 -88.848294                          Secondary   21
26980 -88.886093                         Elementary   22
26981 -89.294984                         Elementary   11
26982 -89.377692                         Elementary   16

                                      11
0      Combined elementary and secondary
1                             Elementary
2                             Elementary
3                             Elementary
4      Combined elementary and secondary
...                                  ...
26978                         Elementary
26979                          Secondary
26980                         Elementary
26981                         Elementary
26982                         Elementary

[26983 rows x 12 columns]

In [42]:
final_df=merged_df.loc[:,[0,1,2,3,4,8,9,10,11]]
final_df.columns=['fid','name','population','county','latitude','longitute','level','enrollment','level.1']
print(final_df)

         fid                                        name  population  \
0       9001               NEW ENGLAND CHRISTIAN ACADEMY         136
1       9002                     SETON ACADEMY FOR GIRLS          57
2       9003                              ST ANNA SCHOOL         157
3       9004  SOUTHEAST ALTERNATIVE SCHOOL-MIDDLE SCHOOL           5
4       9005                             DEVEREUX SCHOOL         123
...      ...                                         ...         ...
26978  20996                         MOST PRECIOUS BLOOD          33
26979  20997                               STARR ACADEMY          29
26980  20998                   ST JOHN'S LUTHERAN SCHOOL          24
26981  20999                     FAITH CHRISTIAN ACADEMY          13
26982  21000                           SHADY PINE SCHOOL          17

          county   latitude  longitute                              level  \
0        BRISTOL  41.758597 -71.175801  Combined elementary and secondary
1        BRISTOL  41.718407 -71.147302                         Elementary
2      WORCESTER  42.517271 -71.751741                         Elementary
3       PLYMOUTH  41.818210 -71.083393                         Elementary
4      WORCESTER  42.383875 -71.968419  Combined elementary and secondary
...          ...        ...        ...                                ...
26978    WAUPACA  44.386281 -88.739200                         Elementary
26979    WAUPACA  44.308621 -88.848294                          Secondary
26980   WAUSHARA  44.202182 -88.886093                         Elementary
26981   WAUSHARA  44.074503 -89.294984                         Elementary
26982   WAUSHARA  44.014975 -89.377692                         Elementary

       enrollment                            level.1
0             120  Combined elementary and secondary
1              49                         Elementary
2             143                         Elementary
3               4                         Elementary
4             107  Combined elementary and secondary
...           ...                                ...
26978          28                         Elementary
26979          21                          Secondary
26980          22                         Elementary
26981          11                         Elementary
26982          16                         Elementary

[26983 rows x 9 columns]

In [44]:
df3=pandas.read_csv('Lab2 D1C.csv')
merged_df=pandas.merge(df3,final_df,how='inner',on='county')
print(merged_df)

           county     city  score    fid  \
0         BRISTOL  SWANSEA     16   9001
1         BRISTOL  SWANSEA     16   9002
2         BRISTOL  SWANSEA     16   9006
3         BRISTOL  SWANSEA     16   9009
4         BRISTOL  SWANSEA     16   9013
...           ...      ...    ...    ...
4221328  WAUSHARA  WAUTOMA      1  20244
4221329  WAUSHARA  WAUTOMA      1  20252
4221330  WAUSHARA  WAUTOMA      1  20998
4221331  WAUSHARA  WAUTOMA      1  20999
4221332  WAUSHARA  WAUTOMA      1  21000

                                               name  population   latitude  \
0                     NEW ENGLAND CHRISTIAN ACADEMY         136  41.758597
1                           SETON ACADEMY FOR GIRLS          57  41.718407
2        NATIVITY PREPARATORY SCHOOL OF NEW BEDFORD          62  41.633263
3                         ST MARY'S CATHOLIC SCHOOL         233  42.035372
4                                             AMEGO          24  42.012844
...                                             ...         ...        ...
4221328                   OAKRIDGE MENNONITE SCHOOL          31  44.067848
4221329                      CHRIST LUTHERAN SCHOOL          30  44.210772
4221330                   ST JOHN'S LUTHERAN SCHOOL          24  44.202182
4221331                     FAITH CHRISTIAN ACADEMY          13  44.074503
4221332                           SHADY PINE SCHOOL          17  44.014975

         longitute                              level  enrollment  \
0       -71.175801  Combined elementary and secondary         120
1       -71.147302                         Elementary          49
2       -70.926852                         Elementary          54
3       -71.202492                         Elementary         219
4       -71.240718  Combined elementary and secondary          19
...            ...                                ...         ...
4221328 -89.141192                         Elementary          28
4221329 -88.972904                         Elementary          27
4221330 -88.886093                         Elementary          22
4221331 -89.294984                         Elementary          11
4221332 -89.377692                         Elementary          16

                                   level.1
0        Combined elementary and secondary
1                               Elementary
2                               Elementary
3                               Elementary
4        Combined elementary and secondary
...                                    ...
4221328                         Elementary
4221329                         Elementary
4221330                         Elementary
4221331                         Elementary
4221332                         Elementary

[4221333 rows x 11 columns]

In [ ]:
#Question 2:

In [45]:
#Question 3:
df=pandas.read_csv('train.csv')
print(df)

           ID  var3  var15  imp_ent_var16_ult1  imp_op_var39_comer_ult1  \
0           1     2     23                 0.0                      0.0
1           3     2     34                 0.0                      0.0
2           4     2     23                 0.0                      0.0
3           8     2     37                 0.0                    195.0
4          10     2     39                 0.0                      0.0
...       ...   ...    ...                 ...                      ...
76015  151829     2     48                 0.0                      0.0
76016  151830     2     39                 0.0                      0.0
76017  151835     2     23                 0.0                      0.0
76018  151836     2     25                 0.0                      0.0
76019  151838     2     46                 0.0                      0.0

       imp_op_var39_comer_ult3  imp_op_var40_comer_ult1  \
0                          0.0                      0.0
1                          0.0                      0.0
2                          0.0                      0.0
3                        195.0                      0.0
4                          0.0                      0.0
...                        ...                      ...
76015                      0.0                      0.0
76016                      0.0                      0.0
76017                      0.0                      0.0
76018                      0.0                      0.0
76019                      0.0                      0.0

       imp_op_var40_comer_ult3  imp_op_var40_efect_ult1  \
0                          0.0                      0.0
1                          0.0                      0.0
2                          0.0                      0.0
3                          0.0                      0.0
4                          0.0                      0.0
...                        ...                      ...
76015                      0.0                      0.0
76016                      0.0                      0.0
76017                      0.0                      0.0
76018                      0.0                      0.0
76019                      0.0                      0.0

       imp_op_var40_efect_ult3  ...  saldo_medio_var33_hace2  \
0                          0.0  ...                      0.0
1                          0.0  ...                      0.0
2                          0.0  ...                      0.0
3                          0.0  ...                      0.0
4                          0.0  ...                      0.0
...                        ...  ...                      ...
76015                      0.0  ...                      0.0
76016                      0.0  ...                      0.0
76017                      0.0  ...                      0.0
76018                      0.0  ...                      0.0
76019                      0.0  ...                      0.0

       saldo_medio_var33_hace3  saldo_medio_var33_ult1  \
0                          0.0                     0.0
1                          0.0                     0.0
2                          0.0                     0.0
3                          0.0                     0.0
4                          0.0                     0.0
...                        ...                     ...
76015                      0.0                     0.0
76016                      0.0                     0.0
76017                      0.0                     0.0
76018                      0.0                     0.0
76019                      0.0                     0.0

       saldo_medio_var33_ult3  saldo_medio_var44_hace2  \
0                         0.0                      0.0
1                         0.0                      0.0
2                         0.0                      0.0
3                         0.0                      0.0
4                         0.0                      0.0
...                       ...                      ...
76015                     0.0                      0.0
76016                     0.0                      0.0
76017                     0.0                      0.0
76018                     0.0                      0.0
76019                     0.0                      0.0

       saldo_medio_var44_hace3  saldo_medio_var44_ult1  \
0                          0.0                     0.0
1                          0.0                     0.0
2                          0.0                     0.0
3                          0.0                     0.0
4                          0.0                     0.0
...                        ...                     ...
76015                      0.0                     0.0
76016                      0.0                     0.0
76017                      0.0                     0.0
76018                      0.0                     0.0
76019                      0.0                     0.0

       saldo_medio_var44_ult3          var38  TARGET
0                         0.0   39205.170000       0
1                         0.0   49278.030000       0
2                         0.0   67333.770000       0
3                         0.0   64007.970000       0
4                         0.0  117310.979016       0
...                       ...            ...     ...
76015                     0.0   60926.490000       0
76016                     0.0  118634.520000       0
76017                     0.0   74028.150000       0
76018                     0.0   84278.160000       0
76019                     0.0  117310.979016       0

[76020 rows x 371 columns]

In [46]:
var=df.loc[:,['var3','var38','var15','imp_op_var39_comer_ult1']]
var.corr()

                             var3     var38     var15  imp_op_var39_comer_ult1
var3                     1.000000  0.000071 -0.004452                 0.005989
var38                    0.000071  1.000000  0.006497                 0.012546
var15                   -0.004452  0.006497  1.000000                 0.094762
imp_op_var39_comer_ult1  0.005989  0.012546  0.094762                 1.000000

In [50]:
print(var['var3'].corr(var['var38']))
print(var['var3'].corr(var['var15']))
print(var['var3'].corr(var['imp_op_var39_comer_ult1']))
print(var['var38'].corr(var['var15']))
print(var['var38'].corr(var['imp_op_var39_comer_ult1']))
print(var['var15'].corr(var['imp_op_var39_comer_ult1']))

7.084161239993955e-05
-0.004451771295409944
0.00598903116857473
0.006496590103000598
0.012546012983893984
0.09476241709977415

The data does not show any strong linear relationship between the variables. Most correlation coefficients are near zero, which suggests that changes in one variable do not linearly explain changes in another. This means the dataset is not linear with respect to these variables.

In [60]:
df.isnull().sum().sum()

np.int64(0)

No missing value